In [1]:
import pandas as pd

In [51]:
pd.read_csv("../data/products.csv", encoding='latin1')
products_cols = "ProductID",["ProductName","CategoryID","UnitPrice","UnitsInStock","UnitsOnOrder","ReorderLevel","Discoontinued"]

,ProductID,ProductName,SupplierID,CategoryID,QuantityPerUnit,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued
0,1,Chai,1,1,10 boxes x 20 bags,$18.00,39,0,10,0
1,2,Chang,1,1,24 - 12 oz bottles,$19.00,17,40,25,0
2,3,Aniseed Syrup,1,2,12 - 550 ml bottles,$10.00,13,70,25,0
3,4,Chef Anton's Cajun Seasoning,2,2,48 - 6 oz jars,$22.00,53,0,0,0
4,5,Chef Anton's Gumbo Mix,2,2,36 boxes,$21.35,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...
72,73,Röd Kaviar,17,8,24 - 150 g jars,$15.00,101,0,5,0
73,74,Longlife Tofu,4,7,5 kg pkg.,$10.00,4,20,5,0
74,75,Rhönbräu Klosterbier,12,1,24 - 0.5 l bottles,$7.75,125,0,25,0
75,76,Lakkalikööri,23,1,500 ml,$18.00,57,0,20,0
76,77,Original Frankfurter grüne Soße,12,2,12 boxes,$13.00,32,0,15,0

In [48]:
pd.read_csv("../data/categories.csv", encoding='latin1')

,CategoryID,CategoryName,Description,Picture
0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales",NaN
1,2,Condiments,"Sweet and savory sauces, relishes, spreads, an...",NaN
2,3,Confections,"Desserts, candies, and sweet breads",NaN
3,4,Dairy Products,Cheeses,NaN
4,5,Grains/Cereals,"Breads, crackers, pasta, and cereal",NaN
5,6,Meat/Poultry,Prepared meats,NaN
6,7,Produce,Dried fruit and bean curd,NaN
7,8,Seafood,Seaweed and fish,NaN

In [57]:
products_cols = ["ProductID","ProductName","CategoryID","UnitPrice","UnitsInStock","UnitsOnOrder","ReorderLevel","Discontinued"]
categories_cols = ["CategoryID","CategoryName"]
orders_cols = ["OrderID","CustomerID","OrderDate","ShipCountry"]

products = pd.read_csv("../data/products.csv", usecols=products_cols, encoding='latin1')
categories = pd.read_csv("../data/categories.csv", usecols=categories_cols, encoding='latin1')
orders = pd.read_csv("../data/orders.csv", usecols=orders_cols)
order_details = pd.read_csv("../data/order_details.csv")
locations = pd.read_csv("../data/customers.csv",usecols=['CustomerID', 'Country'])

In [58]:
display(products.head(3), categories.head(3), orders.head(3), order_details.head(3), locations.head(3))

,ProductID,ProductName,CategoryID,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued
0,1,Chai,1,$18.00,39,0,10,0
1,2,Chang,1,$19.00,17,40,25,0
2,3,Aniseed Syrup,2,$10.00,13,70,25,0

   CategoryID CategoryName
0           1    Beverages
1           2   Condiments
2           3  Confections

   OrderID CustomerID   OrderDate ShipCountry
0    10389      BOTTM  1995-01-20      Canada
1    10390      ERNSH  1995-01-23     Austria
2    10391      DRACD  1995-01-23     Germany

   OrderID  ProductID  UnitPrice  Quantity  Discount
0    10248         11       14.0        12       0.0
1    10248         42        9.8        10       0.0
2    10248         72       34.8         5       0.0

  CustomerID  Country
0      ALFLI  Germany
1      ANATR   Mexico
2      ANTON   Mexico

In [59]:
display(products.info(),categories.info(),orders.info(),order_details.info(), locations.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ProductID     77 non-null     int64
 1   ProductName   77 non-null     object
 2   CategoryID    77 non-null     int64
 3   UnitPrice     77 non-null     object
 4   UnitsInStock  77 non-null     int64
 5   UnitsOnOrder  77 non-null     int64
 6   ReorderLevel  77 non-null     int64
 7   Discontinued  77 non-null     int64
dtypes: int64(6), object(2)
memory usage: 4.9+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CategoryID    8 non-null      int64
 1   CategoryName  8 non-null      object
dtypes: int64(1), object(1)
memory usage: 260.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 830 entries, 0 to 829
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   OrderID      830 non-null    int64
 1   CustomerID   830 non-null    object
 2   OrderDate    830 non-null    object
 3   ShipCountry  830 non-null    object
dtypes: int64(1), object(3)
memory usage: 26.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2155 entries, 0 to 2154
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   OrderID    2155 non-null   int64
 1   ProductID  2155 non-null   int64
 2   UnitPrice  2155 non-null   float64
 3   Quantity   2155 non-null   int64
 4   Discount   2155 non-null   float64
dtypes: float64(2), int64(3)
memory usage: 84.3 KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 91 entries, 0 to 90
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  91 non-null     object
 1   Country     91 non-null     object
dtypes: object(2)
memory usage: 1.6+ KB

None

None

None

None

None

### Cleaning Data

In [68]:
products["UnitPrice"] = products["UnitPrice"].str.replace("$","").astype("float64")

orders['OrderDate'] = pd.to_datetime(orders['OrderDate'])

### Merging the Dataframes

In [34]:
# display(orders.head(), order_details.head())
orders_sales = pd.merge(orders, order_details, on="OrderID")
orders_sales.head()

,OrderID,CustomerID,OrderDate,ShipCountry,ProductID,UnitPrice,Quantity,Discount
0,10389,BOTTM,1995-01-20,Canada,10,24.8,16,0.0
1,10389,BOTTM,1995-01-20,Canada,55,19.2,15,0.0
2,10389,BOTTM,1995-01-20,Canada,62,39.4,20,0.0
3,10389,BOTTM,1995-01-20,Canada,70,12.0,30,0.0
4,10390,ERNSH,1995-01-23,Austria,31,10.0,60,0.1

In [ ]:
products_with_categories = pd.merge(products, categories, on=)